# Εισαγωγή στον Προγραμματισμό με Python
# Εβδομάδα 6
#===================================================
#
# Άσκηση 6.1: Αρίθμηση γραμμών σε αρχείο κειμένου
#
# Μια απλη λυση ειναι η παρακάτω:
#
##
##try:
##    with open('cities.txt','r') as fin:         # Ανοίγω το cities.txt 
##        cities = fin.readlines()                # διαβάζω τα δεδομένα με readlines() ώστε να τα έχω σε μορφη λιστας
##        try:
##            with open('out.txt', 'w') as fout:          # Ανοίγω το out.txt σε δικο του διαχειριστή try..except  
##                for index,line in enumerate(cities):    # index ο δεικτης 0,1,.. και line η καθε γραμμή στη λιστα cities 
##                    newline = str(index+1)+': '+line    # Διαμορφώνω τη γραμμη όπως ζητά η άσκηση
##                    fout.write(newline)                 # Γράφω στο out.txt
##        except Exception as err:
##            print('Σφάλμα διαχείρισης του out.txt: ', err)  # Αν συμβεί σφάλμα στη with του out.txt
##except Exception as err:
##    print('Σφάλμα διαχείρισης του cities.txt: ', err)       # Αν συμβεί σφάλμα στη with του cities.txt
##
##
##
## Μία περισσότερο Pythonic λυση:
##
##
##try:
##    with open('cities.txt','r') as fin, open('out.txt', 'w') as fout:       # Μπορούμε να ανοίξουμε τα 2 αρχεια με αυτή τη σύνταξη
##        for index,line in enumerate(fin):               # Το αντικειμενο αρχειου fin είναι ήδη iterable άρα μπορει να χρησιμοποιηθεί στη for  
##            fout.write(str(index+1)+': '+line)          # Γράφουμε άμεσα τη νέα μορφη γραμμής στο fout
##except Exception as err:                                
##    print('Σφάλμα διαχείρισης: ', err)          # Αν συμβει σφάλμα η err θα μας δώσει πληροφορίες  
##    

#
#=========================================================================================================================
#
#
# Άσκηση 6.2: Έλεγχος αρχείου εικόνας 
#
# Μια λυση που χρησιμοποιει την δεκαεξαδικη μορφή της τιμής του byte ειναι η παρακάτω:
#
##jpgsign = 'ffd8ff'                  # Καθορίζω την υπογραφη του τύπου jpg ως αλφαριθμητικο 'ffd8ff'
##    
##with open('imag', 'rb') as bf:       
##    data = bf.read()                # Διαβάζω το περιεχομενο (δηλ. τις τιμές των bytes) του αρχειου imag
##    fsign = ''
##    for i in data[:3]:              # Ελέγχω τα 3 πρώτα bytes
##        ihex = hex(i)               # Δημιουργώ την δεκαεξαδική μορφη
##        print(i,ihex)               # Εμφανίζω τις ζητούμενες τιμές (σε δεκαδικο και δεκαεξαδικο συστημα) 
##        fsign = fsign+ihex[2:]      # Δημιουργώ την 'υπογραφή' fsign του αρχειου imag ως εξής:
##                                    # Επειδή η δεκαεξαδικη τιμη παριστάνεται ως αλφαριθμητικο πχ. '0xff'...
##                                    # ..παίρνω τους 2 τελευταίους χαρακτήρες ihex[2:] και τους συνενώνω για τα 3 πρώτα bytes
##                                    # Αν το αρχειο imag ειναι πράγματι jpg το fsign θα πάρει σταδιακά την τιμη 'ffd8ff'
##    
##if fsign == jpgsign:                # Ελέγχω αν η υπογραφη fsign είναι ίδια με την υπογραφη jpgsign
##    print('Το αρχείο είναι τύπου jpg')
##else:
##    print('Το αρχείο ΔΕΝ είναι τύπου jpg')
##    


